<a href="https://colab.research.google.com/github/Rs-Biranchi/FlipRobo/blob/master/Titanic_preoject_DL_12_12_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import tensorflow as tf

In [22]:
data=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/titanic.csv')
data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [24]:
data.drop(['PassengerId','Name','Ticket','Cabin'],axis=1,inplace=True)
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [25]:
data.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [26]:
from sklearn.impute import SimpleImputer
imp=SimpleImputer(strategy='mean')
data.Age=imp.fit_transform(data.Age.values.reshape(-1,1))
data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [28]:
imp=SimpleImputer(strategy='most_frequent')
data.Embarked=imp.fit_transform(data.Embarked.values.reshape(-1,1))
data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [29]:
data.nunique()

Survived      2
Pclass        3
Sex           2
Age          89
SibSp         7
Parch         7
Fare        248
Embarked      3
dtype: int64

In [30]:
from sklearn.preprocessing import LabelEncoder

In [31]:
data.Sex=pd.get_dummies(data['Sex'],drop_first=True)
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    1  22.0      1      0   7.2500        S
1         1       1    0  38.0      1      0  71.2833        C
2         1       3    0  26.0      0      0   7.9250        S
3         1       1    0  35.0      1      0  53.1000        S
4         0       3    1  35.0      0      0   8.0500        S

In [32]:
le=LabelEncoder()
data.Embarked=le.fit_transform(data.Embarked.values.reshape(-1,1))
data.head()

/usr/local/lib/python3.6/dist-packages/sklearn/preprocessing/_label.py:251: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [33]:
x=data.iloc[:,1:10]
x.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [34]:
x.shape

(891, 7)

In [39]:
y=data.iloc[:,0].values.reshape(-1,1)

In [40]:
y.shape

(891, 1)

In [41]:
from sklearn.model_selection import train_test_split
train_x,train_y,test_x,test_y=train_test_split(x,y,test_size=0.25,stratify=y)

In [42]:
train_x.shape

(668, 7)

In [43]:
train_x.max()

Pclass        3.0000
Sex           1.0000
Age          71.0000
SibSp         8.0000
Parch         6.0000
Fare        512.3292
Embarked      2.0000
dtype: float64

In [44]:
train_x.min()

Pclass      1.00
Sex         0.00
Age         0.42
SibSp       0.00
Parch       0.00
Fare        0.00
Embarked    0.00
dtype: float64

In [46]:
from tensorflow.keras import layers
from tensorflow import keras
input=keras.Input(shape=(None,),dtype='int32')

In [47]:
X_=layers.Embedding(15000,128)(input)

In [48]:
type(X_)

tensorflow.python.framework.ops.Tensor

In [49]:
X_=layers.Bidirectional(layers.LSTM(64,return_sequences=True))(X_)
X_=layers.Bidirectional(layers.LSTM(64))(X_)

In [50]:
output=layers.Dense(1,activation='sigmoid')(X_)
model=keras.Model(input,output)

In [51]:
model.layers

[<tensorflow.python.keras.engine.input_layer.InputLayer at 0x7fb63e06b390>,
 <tensorflow.python.keras.layers.embeddings.Embedding at 0x7fb63e0377b8>,
 <tensorflow.python.keras.layers.wrappers.Bidirectional at 0x7fb63e157e10>,
 <tensorflow.python.keras.layers.wrappers.Bidirectional at 0x7fb63768fc88>,
 <tensorflow.python.keras.layers.core.Dense at 0x7fb637555cc0>]

In [52]:
model.summary()

Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_2 (InputLayer)         [(None, None)]            0
_________________________________________________________________
embedding (Embedding)        (None, None, 128)         1920000
_________________________________________________________________
bidirectional (Bidirectional (None, None, 128)         98816
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128)               98816
_________________________________________________________________
dense (Dense)                (None, 1)                 129
=================================================================
Total params: 2,117,761
Trainable params: 2,117,761
Non-trainable params: 0
_________________________________________________________________

In [53]:
x_train=keras.preprocessing.sequence.pad_sequences(train_x,maxlen=200)
x_test=keras.preprocessing.sequence.pad_sequences(test_x,maxlen=200)

ValueError: ignored